load_tests/data_format_converter/dfc-load-test.yml
config:
  target: https://9lozyhe69i.execute-api.eu-west-1.amazonaws.com/dev
  phases:
    - duration: 10
      arrivalRate: 10
      name: Warm up phase
    - duration: 10
      arrivalRate: 10
      rampTo: 20
      name: Ramp up phase
    - duration: 10
      arrivalRate: 20
      name: Steady state phase
    - duration: 10
      arrivalRate: 20
      rampTo: 40
      name: Spike phase
  environments:
    r1:
      target: https://1lo2ovw2ja.execute-api.eu-west-1.amazonaws.com/r1
      phases:
        - duration: 10
          arrivalRate: 10
          name: Warm up phase
    r2:
      target: https://nwyklrykmb.execute-api.eu-west-1.amazonaws.com/r2
      phases:
        - duration: 10
          arrivalRate: 10
          name: Warm up phase
    r4:
      target: https://lsrjs6t7lg.execute-api.eu-west-1.amazonaws.com/r4
      phases:
        - duration: 10
          arrivalRate: 10
          name: Warm up phase

scenarios:
  - name: 'company_directory01'
    weight: 4
    flow:
      - post:
          url: "/convert?bucket=format-convertor-dev-buck&key=company_directory.json&format=xml"
          expect:
            statusCode: 200
            json:
              uri: "s3://format-convertor-dev-buck/company_directory.json.xml"
              presigned_url: "#string"
  - name: 'company_directory02'
    weight: 3
    flow:
      - post:
          url: "/convert?bucket=format-convertor-dev-buck&key=company_directory02.json&format=xml"
          expect:
            statusCode: 200
            json:
              uri: "s3://format-convertor-dev-buck/company_directory02.json.xml"
              presigned_url: "#string"
  - name: 'company_directory03'
    weight: 3
    flow:
      - post:
          url: "/convert?bucket=format-convertor-dev-buck&key=company_directory03.json&format=xml"
          expect:
            statusCode: 200
            json:
              uri: "s3://format-convertor-dev-buck/company_directory03.json.xml"
              presigned_url: "#string"

output:
  includeOnly:
    - http